package by.tatevik.javapractice.task25;

public class Main {

  /*  task22.
    Создать класс LetterManager,  принимающий в свои методы тип интерфейса.

    Создать класс Письмо.
    Реализовать с использованием интерфейса возможности:
    Добавить текст письма/удалить текст письма, добавить/удалить отправи-
    теля; добавить/удалить приложения к письму; поста-
    вить дату отправки; отправить/принять письмо; проверить
    адресат на существование. Реализовать код  так, чтобы из метода
    main можно было вызвать LetterManager, но нельзя было обратиться к
    методам самого класса Письма. Произвести над письмом различные манипуляции
    из метода main.
   */

  public static void main(String[] args) {

  }
}
